# SetEndHandle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlesData..::..SetEndHandle Method
RebarHandlesData Class See Also
---
Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetEndHandle(
	int endHandleTag
)
```

Visual Basic
---
```text
Public Sub SetEndHandle ( _
	endHandleTag As Integer _
)
```

Visual C++
---
```text
public:
void SetEndHandle(
	int endHandleTag
)
```

# ### Parameters
endHandleTag
    Type: System..::..Int32 The tag of the end handle.
# See Also
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace